Revit 2026 API

# StructuralConnectionHandlerCreate(Document, IListElementId, ElementId, IListConnectionInputPoint) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralConnectionHandler Create(
	Document document,
	IList<ElementId> idsToConnect,
	ElementId typeId,
	IList<ConnectionInputPoint> additionalInputPoints
)
```
```vb
Public Shared Function Create (
	document As Document,
	idsToConnect As IList(Of ElementId),
	typeId As ElementId,
	additionalInputPoints As IList(Of ConnectionInputPoint)
) As StructuralConnectionHandler
```
```cpp
public:
static StructuralConnectionHandler^ Create(
	Document^ document,
	IList<ElementId^>^ idsToConnect,
	ElementId^ typeId,
	IList<ConnectionInputPoint^>^ additionalInputPoints
)
```
```fsharp
static member Create :
        document : Document *
        idsToConnect : IList<ElementId> *
        typeId : ElementId *
        additionalInputPoints : IList<ConnectionInputPoint> -> StructuralConnectionHandler
```

#### Parameters

document Document

idsToConnect IListElementId

typeId ElementId

additionalInputPoints IListConnectionInputPoint

#### Return Value

StructuralConnectionHandler

#### Reference

StructuralConnectionHandler Class

Create Overload

Autodesk.Revit.DB.Structure Namespace